snlkuharlocal/src/Documents/ЗаявкаНаПередачуКарточекНоменклатурыВЧЗ/ЗаявкаНаПередачуКарточекНоменклатурыВЧЗ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЗаявкаНаПередачуКарточекНоменклатурыВЧЗ</name>
  <basedOn>Catalog.Номенклатура</basedOn>
  <basedOn>Document.ЗаказПоставщику</basedOn>
  <registerRecords>InformationRegister.СтатусыНоменклатуры_ЧЗ</registerRecords>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ГруппыТоваров</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыДокументовМаркировки</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.Комплектация</types>
      <types>DocumentRef.ЗаказПоставщику</types>
      <types>DocumentRef.Инвентаризация</types>
      <types>CatalogRef.Номенклатура</types>
      <types>DocumentRef.РасходнаяНакладная</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>9</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоНаМодерации</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>9</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоОпубликовано</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>9</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИД_ДокументаЧЗ</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТекстОшибки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>ГТИН</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>14</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Статус</name>
      <type>
        <types>EnumRef.СтатусыКарточкиНоменклатурыВЧЗ</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

snlkuharlocal/src/Enums/СтатусыДокументовМаркировки/СтатусыДокументовМаркировки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтатусыДокументовМаркировки</name>
  <enumValues>
    <name>ВРаботе</name>
  </enumValues>
  <enumValues>
    <name>ОжиданиеОтложеннойОбработки</name>
  </enumValues>
  <enumValues>
    <name>КОбработке</name>
  </enumValues>
  <enumValues>
    <name>Обрабатывается</name>
  </enumValues>
  <enumValues>
    <name>ОшибкаОбработки</name>
  </enumValues>
  <enumValues>
    <name>ОбработанЧЗ</name>
  </enumValues>
  <enumValues>
    <name>ОшибкаОбработкиЧЗ</name>
  </enumValues>
  <enumValues>
    <name>Обработан</name>
  </enumValues>
</mdclass:Enum>

snlkuharlocal/src/Enums/СтатусыКарточкиНоменклатурыВЧЗ/СтатусыКарточкиНоменклатурыВЧЗ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтатусыКарточкиНоменклатурыВЧЗ</name>
  <enumValues>
    <name>НеПодлежитМаркировке</name>
  </enumValues>
  <enumValues>
    <name>КОтправкевНК</name>
  </enumValues>
  <enumValues>
    <name>НеСоздана</name>
  </enumValues>
  <enumValues>
    <name>Создана</name>
  </enumValues>
  <enumValues>
    <name>НаМодерации</name>
  </enumValues>
  <enumValues>
    <name>ОжидаетПодписания</name>
  </enumValues>
  <enumValues>
    <name>Отклонена</name>
  </enumValues>
  <enumValues>
    <name>Опубликована</name>
  </enumValues>
</mdclass:Enum>

snlkuharlocal/src/Documents/ЗаявкаНаПередачуКарточекНоменклатурыВЧЗ/ManagerModule.bsl
Функция ПроверитьДокументПередОтправкойВЧЗ(ДокСсылка) Экспорт
	Результат = МаркировкаКС.СтруктураРезультата(Ложь);
	
	Реквизиты = ПолучитьРеквизитыШапки(ДокСсылка, "Проведен,Статус");
	Если Реквизиты.Проведен Тогда
		Если Реквизиты.Статус = Перечисления.СтатусыДокументовМаркировки.ВРаботе
			ИЛИ Реквизиты.Статус = Перечисления.СтатусыДокументовМаркировки.КОбработке Тогда
			
			Результат.Успешно = Истина;
		Иначе			
			ТекстОшибки = СтрШаблон("Не допустимый статус док-та: %1, статус: '%2', должен быть: 'В работе' или 'К обработке'.", ДокСсылка, Реквизиты.Статус);
			Результат.Ошибки.Добавить(ТекстОшибки);
		КонецЕсли; 	
	Иначе
		ТекстОшибки = СтрШаблон("Документ  '%1' не проведен.", ДокСсылка);
		Результат.Ошибки.Добавить(ТекстОшибки);
	КонецЕсли;
	
	Возврат Результат;
КонецФункции //ПроверитьДокументПередОтправкойВЧЗ()

Функция ПроверитьДублиКарточек(ДокСсылка) Экспорт
	Результат = МаркировкаКС.СтруктураРезультата();
	
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	ЗаявкаТек.Номенклатура 			КАК Номенклатура,
	|	ЗаявкаТек.Номенклатура.ГТИН		КАК ГТИН,
	|
	|	ЗаявкаТек.Ссылка.Организация	КАК ОрганизацияТек,	
	|	ЗаявкаТек.Ссылка.Автор			КАК АвторТек,
	|
	|	ЗаявкаАльт.Ссылка				КАК СсылкаАльт,
	|	ЗаявкаАльт.Ссылка.Организация	КАК ОрганизацияАльт,
	|	ЗаявкаАльт.Статус				КАК СтатусАльт,
	|	ЗаявкаАльт.Ссылка.Автор			КАК АвторАльт
	|ИЗ
	|	Документ.ЗаявкаНаПередачуКарточекНоменклатурыВЧЗ.Товары КАК ЗаявкаТек
	|ЛЕВОЕ СОЕДИНЕНИЕ
	|	Документ.ЗаявкаНаПередачуКарточекНоменклатурыВЧЗ.Товары КАК ЗаявкаАльт
	|ПО
	|	ЗаявкаАльт.Номенклатура = ЗаявкаТек.Номенклатура	
	|	И ЗаявкаАльт.Ссылка <> ЗаявкаТек.Ссылка
	|	И ЗаявкаАльт.Ссылка.Проведен = Истина
	|	И ЗаявкаАльт.Ссылка.Дата <= ЗаявкаТек.Ссылка.Дата
	|	И ЗаявкаАльт.Статус В (&Статусы_ПринятоЧЗ)	
	|	И НЕ ЗаявкаАльт.Ссылка.ПометкаУдаления
	|	И (
	|		ЗаявкаАльт.Ссылка.Организация = ЗаявкаТек.Ссылка.Организация
	|		ИЛИ (ПОДСТРОКА(ЗаявкаТек.Номенклатура.ГТИН, 0, 3) = ""046"" И ЗаявкаАльт.Ссылка.Организация = &Организация_ЕЕ)
	|	)	
	|ГДЕ
	|	ЗаявкаТек.Ссылка = &Ссылка
	|	И НЕ ЗаявкаАльт.Ссылка ЕСТЬ NULL
	|ИТОГИ ПО
	|	Номенклатура	
	|";
	
	Статусы_ПринятоЧЗ = Новый Массив;
	Статусы_ПринятоЧЗ.Добавить(Перечисления.СтатусыКарточкиНоменклатурыВЧЗ.НаМодерации);
	Статусы_ПринятоЧЗ.Добавить(Перечисления.СтатусыКарточкиНоменклатурыВЧЗ.ОжидаетПодписания);
	Статусы_ПринятоЧЗ.Добавить(Перечисления.СтатусыКарточкиНоменклатурыВЧЗ.Опубликована);
	
	Запрос.УстановитьПараметр("Ссылка", 		ДокСсылка);
	Запрос.УстановитьПараметр("Организация_ЕЕ",	Маркировка_ПИ.ОрганизацияЕЕЭ());
	Запрос.УстановитьПараметр("Статусы_ПринятоЧЗ", Статусы_ПринятоЧЗ);
	
	Дубли = Новый Соответствие;
	
	Выборка_Номенклатура = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "Номенклатура");
	Пока Выборка_Номенклатура.Следующий() Цикл
		Выборка = Выборка_Номенклатура.Выбрать();
		Пока Выборка.Следующий() Цикл
			ТекстОшибки = СтрШаблон("Карточка %1 (%2) уже присутствует в док-те %3 в статусе: %4 (Организация: %5, автор: %6) !",
				Выборка.Номенклатура, Выборка.ГТИН, Выборка.СсылкаАльт, Выборка.СтатусАльт, Выборка.ОрганизацияАльт, Выборка.АвторАльт);
			Результат.Ошибки.Добавить(ТекстОшибки);			
		КонецЦикла;
		
		Дубли[Выборка_Номенклатура.Номенклатура] = Истина;
	КонецЦикла; 
	
	Результат.Успешно = ( Результат.Ошибки.Количество() = 0 );
	Результат.Вставить("Дубли", Дубли);
	
	Возврат Результат;
КонецФункции //ПроверитьДублиКарточек(ДокСсылка)

Функция ПроверитьДокументПередПолучениемИзЧЗ(ДокСсылка) Экспорт
	Результат = МаркировкаКС.СтруктураРезультата(Ложь);
	
	Реквизиты = ПолучитьРеквизитыШапки(ДокСсылка, "Проведен,Статус");
	Если Реквизиты.Проведен Тогда
		Если Реквизиты.Статус = Перечисления.СтатусыДокументовМаркировки.Обрабатывается
			ИЛИ Реквизиты.Статус = Перечисления.СтатусыДокументовМаркировки.Обработан Тогда
			Результат.Успешно = Истина;
		Иначе			
			ТекстОшибки = СтрШаблон("Не допустимый статус док-та: %1, статус: '%2', должен быть: 'Обрабатывается'.", ДокСсылка, Реквизиты.Статус);
			Результат.Ошибки.Добавить(ТекстОшибки);
		КонецЕсли; 	
	Иначе
		Результат.Ошибки.Добавить("Документ не проведен.");
	КонецЕсли;
	
	рПроверкиГТИН = ПроверитьГТИН(ДокСсылка);
	Если НЕ рПроверкиГТИН.Успешно Тогда
		Результат.Успешно = Ложь;
		
		МаркировкаКС.ДобавитьОшибки(Результат, рПроверкиГТИН);			
	КонецЕсли;
	
	Возврат Результат;

КонецФункции //ПроверитьДокументПередПолучениемИзЧЗ(ДокСсылка) Экспорт

Функция ПроверитьГТИН(ДокСсылка)
	Результат = МаркировкаКС.СтруктураРезультата();
	
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	Номенклатура,
	|	Номенклатура.Код	КАК Номенклатура_Код,
	|	ГТИН				КАК ГТИН_Док,
	|	Номенклатура.ГТИН	КАК ГТИН_Ном
	|ИЗ
	|	Документ.ЗаявкаНаПередачуКарточекНоменклатурыВЧЗ.Товары
	|ГДЕ
	|	Ссылка = &ДокСсылка
	|	И Номенклатура.ГТИН <> ГТИН	
	|";                            
	
	Запрос.УстановитьПараметр("ДокСсылка", ДокСсылка);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ТекстОшибки = СтрШаблон("Не соответствуют GTIN в номенклатуре и документе. Ном-ра: '%1' (%2), GTIN в док.: %3, в ном.: %4.", 
			Выборка.Номенклатура, Выборка.Номенклатура_Код, Выборка.ГТИН_Док, Выборка.ГТИН_Ном); 
		Результат.Ошибки.Добавить(ТекстОшибки);	
	КонецЦикла;                              
	
	Результат.Успешно = (Результат.Ошибки.Количество() = 0);
	
	Возврат Результат;
КонецФункции //ПроверитьГТИН(ДокСсылка)
